var shop = ['car', 'cat', 'tomato']; // Массив объявляется квадратными скобками. Через запятую перечесляются жлементы массива.

shop[0]; // Чтобы обратиться к элементу массива

shop.length; // Свойство length вернет колличество элементов в массиве.

shop[4] = 'pen'; // Добавили значение "pen" на место 4ого индекса.

shop.pop(); // Команда pop удаляет последний элемент из массива.
shop.push('pen'); // Добавляет элемент в конец массива.

shop.shift(); // Команда shift удаляет первый элемент из массива.
shop.unshift('car'); // Добавляет элемент к начало массива.


